# Приведем плейлист песен в виде списка списков и словаря.
# Посчитайте общее время звучания трех случайных песен.
# Используйте модули random и datetime. Или любые другие.
# Подумайте, как можно представить решение в виде одной функции,
# которая принимает разные типы данных?

# Вариант 1
my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]

